Revit 2026 API

# MEPSystemTypeFillColor Property

---

Indicates the color that should override the fill color for all components in the system.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color FillColor { get; set; }
```
```vb
Public Property FillColor As Color
	Get
	Set
```
```cpp
public:
property Color^ FillColor {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member FillColor : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

MEPSystemType Class

Autodesk.Revit.DB Namespace